Service - Investment Income Reporting/Product - AIL/sample messages/AILFileRequestUpdate_SubmissionKey.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:r="https://services.ird.govt.nz/GWS/Returns/" xmlns:fil="https://services.ird.govt.nz/GWS/Returns/:types/FileRequest">
    <soap:Header xmlns:a="http://www.w3.org/2005/08/addressing">
        <a:Action>https://services.ird.govt.nz/GWS/Returns/Return/File</a:Action>
    </soap:Header>
    <soap:Body>
        <r:File>
            <r:ReturnFileRequestMsg>
                <fil:FileRequestWrapper>
                    <ret:fileRequest xmlns:ret="urn:www.ird.govt.nz/GWS:types/ReturnAIL.v1" xmlns:ret1="urn:www.ird.govt.nz/GWS:types/ReturnCommon.v2" xmlns:com="urn:www.ird.govt.nz/GWS:types/Common.v2" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
                        <ret1:fileHeader>
                            <com:softwareProviderData>
                                <com:softwareProvider>softwareProvider</com:softwareProvider>
                                <com:softwarePlatform>softwarePlatform</com:softwarePlatform>
                                <com:softwareRelease>v1</com:softwareRelease>
                            </com:softwareProviderData>
                            <com:identifier IdentifierValueType="IRD">123768566</com:identifier>
                            <com:accountType>AIL</com:accountType>
                            <ret1:periodEndDate>2019-04-30</ret1:periodEndDate>
                            <ret1:majorFormType>AIL</ret1:majorFormType>
                            <ret1:minorFormType>AIL</ret1:minorFormType>
                        </ret1:fileHeader>
                        <ret1:fileBody xmlns:ret="urn:www.ird.govt.nz/GWS:types/ReturnAIL.v1" xmlns:ret1="urn:www.ird.govt.nz/GWS:types/ReturnCommon.v2">
                            <ret1:standardFields>
                                <ret1:isNilReturn>false</ret1:isNilReturn>
                                <ret1:isFinalReturn>false</ret1:isFinalReturn>
                                <ret1:amendmentRequest>
                                    <ret1:isAmended>true</ret1:isAmended>
                                    <ret1:amendReason>MATH</ret1:amendReason>
                                    <ret1:amendDetails>An amendment from the AIL Test Harness</ret1:amendDetails>
                                </ret1:amendmentRequest>
                            </ret1:standardFields>
                            <ret1:formFields xsi:type="ret:FormFieldsType">
                                <ret:submissionKey>1333370880</ret:submissionKey>
                                <ret:isReverseReplace>false</ret:isReverseReplace>
                                <ret:lineItems>
                                    <ret:referenceId>testecternal-id99</ret:referenceId>
                                    <ret:amendType>A</ret:amendType>
                                    <ret:externalID>123</ret:externalID>
                                    <ret:primaryIRD>123671791</ret:primaryIRD>
                                    <ret:primaryDateOfBirth>1970-05-05</ret:primaryDateOfBirth>
                                    <ret:primaryName>Rachel Lawrence</ret:primaryName>
                                    <ret:primaryPhone>2323231321213</ret:primaryPhone>
                                    <ret:primaryEmail>RachelLawrence@IIITest.com</ret:primaryEmail>
                                    <ret:primaryCountry>NZ</ret:primaryCountry>
                                    <ret:primaryAddress>test</ret:primaryAddress>
                                    <ret:incomeInformation>
                                        <ret1:incomeType>NZINT</ret1:incomeType>
                                        <ret1:grossAmount>5005</ret1:grossAmount>
                                        <ret1:rate>10.5</ret1:rate>
                                        <ret:interestZeroRated>75</ret:interestZeroRated>
                                        <ret:deductedAilAmount>53</ret:deductedAilAmount>
                                    </ret:incomeInformation>
                                </ret:lineItems>
                            </ret1:formFields>
                        </ret1:fileBody>
                    </ret:fileRequest>
                </fil:FileRequestWrapper>
            </r:ReturnFileRequestMsg>
        </r:File>
    </soap:Body>
</soap:Envelope>
